Revit 2024 API
ScheduleDefinition.InsertSortGroupField Method
 Adds a new sorting/grouping field at the specified position in the list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void InsertSortGroupField(
	ScheduleSortGroupField sortGroupField,
	int index
)
Visual Basic
Public Sub InsertSortGroupField ( _
	sortGroupField As ScheduleSortGroupField, _
	index As Integer _
)
Visual C++
public:
void InsertSortGroupField(
	ScheduleSortGroupField^ sortGroupField,
	int index
)
Parameters
sortGroupField
Type: Autodesk.Revit.DB.ScheduleSortGroupField
 The sorting/grouping field to add.
index
Type: System.Int32
 The index in the list of sorting/grouping fields.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The field ID is not the ID of a field in this ScheduleDefinition. -or- The field cannot be used for sorting/grouping.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  index is not a valid insert position.
Autodesk.Revit.Exceptions.InvalidOperationException |  The resulting sorting/grouping field count would be greater than 4.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace